export const defaultValues = {
  clientName: '',
  email: '',
  phone: '+380',
  videoPurpose: [],
};

export const questionData = [
  {
    question: 'Для чого Вам потрібно відео?',
    checkBoxName: 'videoPurpose',
    checkboxVariants: [
      {
        id: 1,
        value: 'Відео для сайту',
        label: 'Відео для сайту',
      },
      {
        id: 2,
        value: 'Відео для презентації продукту або послуги',
        label: 'Відео для презентації продукту або послуги',
      },
      {
        id: 3,
        value: 'Відео для соцмереж / YouTube',
        label: 'Відео для соцмереж / YouTube',
      },
      {
        id: 4,
        value: 'Реклама на ТБ',
        label: 'Реклама на ТБ',
      },
      {
        id: 5,
        value: 'Реклама на медіафасадах',
        label: 'Реклама на медіафасадах',
      },
    ],
  },
  {
    question: 'Яка головна мета Вашого відео?',
    checkBoxName: 'videoGoal',
    checkboxVariants: [
      {
        id: 1,
        value: 'Розповісти про продукт або послугу для цільової аудиторії',
        label: 'Розповісти про продукт або послугу для цільової аудиторії',
      },
      {
        id: 2,
        value: 'Підвищіти впізнаваність бренду',
        label: 'Підвищіти впізнаваність бренду',
      },
      {
        id: 3,
        value: 'Сформувати довіру та посилити лояльність співробітників / партнерів / клієнтів',
        label: 'Сформувати довіру та посилити лояльність співробітників / партнерів / клієнтів',
      },
      {
        id: 4,
        value: 'Розповісти про нову акцію / знижку',
        label: 'Розповісти про нову акцію / знижку',
      },
      {
        id: 5,
        value: 'Зафільмувати відео-відгук клієнта',
        label: 'Зафільмувати відео-відгук клієнта',
      },
    ],
  },
  {
    question: 'Яка тривалість відео?',
    checkBoxName: 'videoDuration',
    checkboxVariants: [
      {
        id: 1,
        value: 'Від 10 до 30 секунд',
        label: 'Від 10 до 30 секунд',
      },
      {
        id: 2,
        value: 'Від 30 до 60 секунд',
        label: 'Від 30 до 60 секунд',
      },
      {
        id: 3,
        value: 'Від 1 до 3 хвилин',
        label: 'Від 1 до 3 хвилин',
      },
      {
        id: 4,
        value: 'Від 3 хвилин та більше',
        label: 'Від 3 хвилин та більше',
      },
      {
        id: 5,
        value: 'Ми будемо знімати кіно =)',
        label: 'Ми будемо знімати кіно =)',
      },
    ],
  },
  {
    question: 'Коли Ви бажаєте отримати готовий відеоролик?',
    checkBoxName: 'videoTime',
    checkboxVariants: [
      {
        id: 1,
        value: 'Завтра',
        label: 'Завтра',
      },
      {
        id: 2,
        value: 'Через 3-4 дні',
        label: 'Через 3-4 дні',
      },
      {
        id: 3,
        value: 'Через тиждень',
        label: 'Через тиждень',
      },
      {
        id: 4,
        value: 'Через 2 тижні',
        label: 'Через 2 тижні',
      },
      {
        id: 5,
        value: 'Строки не важливі - головне якість',
        label: 'Строки не важливі - головне якість',
      },
    ],
  },
  {
    question: 'Потрібен сценарій для Вашого відео?',
    checkBoxName: 'videoScenario',
    checkboxVariants: [
      {
        id: 1,
        value: 'Так, мені потрібна допомога',
        label: 'Так, мені потрібна допомога',
      },
      {
        id: 2,
        value: 'Бачив чудову ідею, хочу її відтворити',
        label: 'Бачив чудову ідею, хочу її відтворити',
      },
      {
        id: 3,
        value: 'В мене свій сценарій та текст',
        label: 'В мене свій сценарій та текст',
      },
      {
        id: 4,
        value: 'Необхідно просто фільмувати по факту',
        label: 'Необхідно просто фільмувати по факту',
      },
    ],
  },
];

export const budgetOptions = [
  {
    label: 'До 25 000 грн',
    value: 'До 25 000 грн',
  },
  {
    label: 'Від 25 000 до 50 000 грн',
    value: 'Від 25 000 до 50 000 грн',
  },
  {
    label: 'Від 50 000 до 100 000 грн',
    value: 'Від 50 000 до 100 000 грн',
  },
  {
    label: 'Від 100 000 до 300 000 грн',
    value: 'Від 100 000 до 300 000 грн',
  },
  {
    label: 'Від 300 000 до 500 000 грн',
    value: 'Від 300 000 до 500 000 грн',
  },
  {
    label: 'Від 500 000 грн до 1 000 000 грн',
    value: 'Від 500 000 грн до 1 000 000 грн',
  },
  {
    label: 'Гроші є, головне досягти бажаної мети',
    value: 'Гроші є, головне досягти бажаної мети',
  },
];

export const findOptions = [
  {
    label: 'Рекомендація партнерів',
    value: 'Рекомендація партнерів',
  },
  {
    label: 'Instagram',
    value: 'Instagram',
  },
  {
    label: 'Пошук в Google',
    value: 'Пошук в Google',
  },
  {
    label: 'Інше',
    value: 'Інше',
  },
];
