import blogFirstPostTitle from '@/assets/images/blog-post1-title.webp';
import blogSecondPostTitle from '@/assets/images/blog-post2-title.webp';
import post2titleImg from '@/assets/images/post2-title.webp';
import post1thirdImg from '@/assets/images/pexels-donald-tong-66134.webp';
import post1secondImg from '@/assets/images/pexels-pixabay-257904.webp';
import post1firstImg from '@/assets/images/pexels-suzy-hazelwood-1750268.jpg';
import post2firstImg from '@/assets/images/pexels-david-geib-3220846.webp';
import post2secondImg from '@/assets/images/pexels-elijah-odonnell-4066041.webp';

export const blogData = [
  {
    id: '1',
    title: 'Що таке відеопродакшн',
    desc: 'Туточки ми з вами розберемось в загальних рисах що таке відеопродакшн. Ви зрозумієте за що ви платите гроші при замовленні послуги відеовиробництва.',
    img: blogFirstPostTitle,
    titleImg: blogFirstPostTitle,
    mainDesc:
      'Виробництво відео – це, по суті, весь процес створення відео. Незалежно від того, чи це короткометражний фільм, повнометражний фільм, бізнес-маркетингове відео, телевізійна реклама, музичне відео або інший тип фільму, процес може дещо відрізнятися залежно від специфіки, але загальний процес в основному однаковий.',
    content: [
      {
        text:
          'Історично виробництво відео складається з трьох етапів: попереднього виробництва, виробництва та пост-виробництва. Ці етапи відомі як\n' +
          '– Пре-продакшн\n' +
          '– Продакшн\n' +
          '– Постпродакшн\n' +
          '\n' +
          'Ці три підкатегорії охоплюють усі аспекти відеовиробництва, починаючи з моменту, коли у вашій голові з’являється ідея, до моменту, коли відео або фільм виходить у загальний доступ.\n' +
          '\n' +
          '\n' +
          '\n' +
          'Підготовка до виробництва. Пре-продакшн.',
        img: post1firstImg,
      },
      {
        text:
          'Це етап планування. Під час цього процесу не буде запису, лише підготовка.\n' +
          '\n' +
          'Формується ідея, підготовляється сценарій, підбирається акторський склад, вибираються члени аудіо- та фільмування, вибираються місця сцени, сценарій редагується та переглядається, якщо необхідно, створюється схема всього процесу запису.\n' +
          'Правильне освітлення для кожної сцени має вирішальне значення. Сонячне та штучне освітлення часто погано поєднуються, тому час доби, погодні умови та місце для кожної сцени потрібно вибирати дуже ретельно.\n' +
          '\n' +
          ' \n' +
          '\n' +
          'Виробництво. Продакшн.',
        img: post1secondImg,
      },
      {
        text:
          'Після того, як усі актори та знімальна група будуть найняті, а сценарій відредаговано та затверджено, можна розпочинати фактичний процес виробництва. Знімальна група та актори подорожують до кожного місця, і кожна сцена знімається, доки вона не буде задовільною. Потім усі переходять до наступної сцени. Цей процес повторюється, доки не буде знято кожну сцену у фільмі або відео.\n' +
          'Після того, як кожна сцена була знята належним чином, настав час переходити до наступного етапу.\n' +
          '\n' +
          ' \n' +
          '\n' +
          'Пост-виробництво. Постпродакшн.',
        img: post1thirdImg,
      },
    ],
    brief:
      'Постпродакшн охоплює всі дії, які виконуються після завершення фактичного фільмування відео. Це включає об’єднання кожної сцени, синхронізацію аудіо та відео, редагування аудіо та відео, додавання спеціальних ефектів, текст, субтитри, анімацію.\n \n Щоб відеовиробництво було успішним, за ним має стояти набагато більше, ніж просто хлопець або дівчина із камерою.\n \n Відео має бути націлено та правильно розповсюджено, інакше відео охопить лише невелику кількість потенційних клієнтів. Відео, що описує загальний огляд ваших продуктів і/або послуг, чудово підходить, якщо у вас є особлива ніша, але якщо у вас є конкуренція, ваше відео має показати потенційним клієнтам, чому вони повинні вибрати вашу компанію, а не компанію вашого конкурента. З цієї причини ви можете досягти кращих результатів, створивши кілька коротких відео, кожне з яких орієнтовано на певну демографічну групу. Потім відео можна розповсюджувати через правильні платформи, щоб охопити максимальну кількість людей, які можуть бути зацікавлені в послугах вашої компанії.',
  },
  {
    id: '2',
    title: 'Навіщо потрібен відеомаркетинг',
    desc: 'Туточки ми з вами розберемось в загальних рисах що таке відеопродакшн. Ви зрозумієте за що ви платите гроші при замовленні послуги відеовиробництва.',
    img: blogSecondPostTitle,
    titleImg: post2titleImg,
    mainDesc:
      'Відеомаркетинг – це використання відеоконтенту для просування або інформування аудиторії про ваш бренд і продукти. Такі платформи, як YouTube і TikTok, Instagram та Facebook, зосереджуються на відео.',
    content: [
      {
        text:
          'Правильне додавання відео до вашої маркетингової стратегії допоможе підняти бізнес на новий етап. Якщо у вашій стратегії немає відео, значить, ви відстаєте. Але не хвилюйтеся, адже ще не пізно почати.\n' +
          ' \n' +
          ' Чому відеомаркетинг важливий?\n' +
          ' \n' +
          'Дві третини споживачів кажуть, що скоріше подивляться відео, щоб дізнатися про продукт чи послугу, ніж прочитають про неї. І цим, як ви розумієте, вже все сказано. Наразі, відео є найбільшим джерелом інтернет-трафіку в усьому світі – 53,7%, а соціальні мережі посідали лише друге місце – 12,7%.\n' +
          'А по-друге, відео – це рух, а рух привертає нашу увагу. 95% глядачів краще запам’ятовують повідомлення при перегляді відео, бо одночасно задіяні наші органи чуття: зір та слух.',
        img: post2firstImg,
      },
      {
        text:
          'Переваги використання відео для реклами\n' +
          ' \n' +
          'Ми вже розібрались в причинах, чому люди дивляться відео, а тепер розглянемо, як вони можуть допомогти вашому бізнесу. \n' +
          'Відео створює довіру споживачів до вас\n' +
          'За допомогою відео Ви демонструєте свою індивідуальність, історію про те, що рухає вами як брендом.  Потенційна аудиторія ознайомлюється з культурою вашої компанії, таким чином встановлюється емоційний зв’язок зі споживачем, що призводить до більшого почуття довіри.\n' +
          '\n' +
          '\n' +
          '\n' +
          'Відео має вплив на кінцеве рішення покупця\n' +
          'Більшість людей у підсумку купують товар або послугу бренду після перегляду їхнього відео.\n' +
          '\n' +
          '\n' +
          '\n' +
          'Відео має  кращу рентабельність інвестицій, ніж будь-який інший тип публікацій\n' +
          'Дослідження показує, що 74% маркетологів додають відео для покращення SEO, після чого спостерігають загальне зростання відвідуваності вебсайт, лідогенерації та продажів. Відео викликають більше зацікавленості у споживачів, ніж статичні пости, такі як зображення.',
        img: post2secondImg,
      },
    ],
    brief:
      'ВАЖЛИВО\n' +
      '\n' +
      'Відео має бути націлено та правильно розповсюджено, інакше відео охопить лише невелику кількість потенційних клієнтів.\n' +
      '\n' +
      'Відео, що описує загальний огляд ваших продуктів і/або послуг, чудово підходить, якщо у вас є особлива ніша, але якщо у вас є конкуренція, ваше відео має показати потенційним клієнтам, чому вони повинні вибрати вашу компанію, а не компанію вашого конкурента.\n' +
      '\n' +
      'З цієї причини ви можете досягти кращих результатів, створивши кілька коротких відео, кожне з яких орієнтовано на певну демографічну групу. Потім відео можна розповсюджувати через правильні платформи, щоб охопити максимальну кількість людей, які можуть бути зацікавлені в послугах вашої компанії.',
  },
];
